###################################################################

# Created by write_sdc on Fri Apr  5 12:04:21 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clka]
set_driving_cell -lib_cell INVX1 [get_ports clkb]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {tx_data[0]}]
set_driving_cell -lib_cell INVX1 [get_ports tx_rdy]
set_driving_cell -lib_cell INVX1 [get_ports rx_rdy]
create_clock [get_ports clka]  -period 20  -waveform {0 10}
set_input_delay -clock clka  1  [get_ports clkb]
set_input_delay -clock clka  1  [get_ports reset]
set_input_delay -clock clka  1  [get_ports {tx_data[7]}]
set_input_delay -clock clka  1  [get_ports {tx_data[6]}]
set_input_delay -clock clka  1  [get_ports {tx_data[5]}]
set_input_delay -clock clka  1  [get_ports {tx_data[4]}]
set_input_delay -clock clka  1  [get_ports {tx_data[3]}]
set_input_delay -clock clka  1  [get_ports {tx_data[2]}]
set_input_delay -clock clka  1  [get_ports {tx_data[1]}]
set_input_delay -clock clka  1  [get_ports {tx_data[0]}]
set_input_delay -clock clka  1  [get_ports tx_rdy]
set_input_delay -clock clka  1  [get_ports rx_rdy]
set_output_delay -clock clka  1  [get_ports tx_busy]
set_output_delay -clock clka  1  [get_ports {tx_out[7]}]
set_output_delay -clock clka  1  [get_ports {tx_out[6]}]
set_output_delay -clock clka  1  [get_ports {tx_out[5]}]
set_output_delay -clock clka  1  [get_ports {tx_out[4]}]
set_output_delay -clock clka  1  [get_ports {tx_out[3]}]
set_output_delay -clock clka  1  [get_ports {tx_out[2]}]
set_output_delay -clock clka  1  [get_ports {tx_out[1]}]
set_output_delay -clock clka  1  [get_ports {tx_out[0]}]
set_output_delay -clock clka  1  [get_ports tx_done]
set_output_delay -clock clka  1  [get_ports {tcount[3]}]
set_output_delay -clock clka  1  [get_ports {tcount[2]}]
set_output_delay -clock clka  1  [get_ports {tcount[1]}]
set_output_delay -clock clka  1  [get_ports {tcount[0]}]
set_output_delay -clock clka  1  [get_ports {tstate[3]}]
set_output_delay -clock clka  1  [get_ports {tstate[2]}]
set_output_delay -clock clka  1  [get_ports {tstate[1]}]
set_output_delay -clock clka  1  [get_ports {tstate[0]}]
set_output_delay -clock clka  1  [get_ports tx_error]
set_output_delay -clock clka  1  [get_ports tx_idle]
set_output_delay -clock clka  1  [get_ports rx_busy]
set_output_delay -clock clka  1  [get_ports {rx_out[7]}]
set_output_delay -clock clka  1  [get_ports {rx_out[6]}]
set_output_delay -clock clka  1  [get_ports {rx_out[5]}]
set_output_delay -clock clka  1  [get_ports {rx_out[4]}]
set_output_delay -clock clka  1  [get_ports {rx_out[3]}]
set_output_delay -clock clka  1  [get_ports {rx_out[2]}]
set_output_delay -clock clka  1  [get_ports {rx_out[1]}]
set_output_delay -clock clka  1  [get_ports {rx_out[0]}]
set_output_delay -clock clka  1  [get_ports rx_done]
set_output_delay -clock clka  1  [get_ports {rcount[3]}]
set_output_delay -clock clka  1  [get_ports {rcount[2]}]
set_output_delay -clock clka  1  [get_ports {rcount[1]}]
set_output_delay -clock clka  1  [get_ports {rcount[0]}]
set_output_delay -clock clka  1  [get_ports {rstate[3]}]
set_output_delay -clock clka  1  [get_ports {rstate[2]}]
set_output_delay -clock clka  1  [get_ports {rstate[1]}]
set_output_delay -clock clka  1  [get_ports {rstate[0]}]
set_output_delay -clock clka  1  [get_ports rx_error]
set_output_delay -clock clka  1  [get_ports rx_idle]
set_output_delay -clock clka  1  [get_ports match]
set_output_delay -clock clka  1  [get_ports {rxrxout[7]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[6]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[5]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[4]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[3]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[2]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[1]}]
set_output_delay -clock clka  1  [get_ports {rxrxout[0]}]
